app/controllers/abouts_controller.rb

  def index
    @abouts = About.all
---
SELECT `abouts`.* FROM `abouts` ORDER BY created_at DESC LIMIT 1

  def show
    @about = About.find(params[:id])
---
SELECT `abouts`.* FROM `abouts` WHERE `abouts`.`id` = 1 LIMIT 1

  def edit
    @about = About.find(params[:id])
---
SELECT `abouts`.* FROM `abouts` WHERE `abouts`.`id` = 2 LIMIT 1

  def create
    @about = About.new(params[:about])

    respond_to do |format|
      if @about.save
---
INSERT INTO `abouts` (`created_at`, `updated_at`, `title`, `body`) VALUES ('2011-12-31 08:31:03', '2011-12-31 08:31:03', 'I am awesome', 'Look at me!')

  def update
    @about = About.find(params[:id])

    respond_to do |format|
      if @about.update_attributes(params[:about])
---
SELECT `abouts`.* FROM `abouts` WHERE `abouts`.`id` = 2 LIMIT 1
UPDATE `abouts` SET `title` = 'About Michelle', `body` = 'My name is Michelle I am a stay at home mom with an intense love for \r\ncooking and a steady hand for decorating. I got started in the food \r\nbusiness after winning a high school scholarship to attended \r\nScottsdale Culinary Institute. I specialized in pastries and baking, \r\nand later worked in a French pastry shop and at several restaurants in \r\nthe pastry department. Since being married and having children, I \r\nfound I could keep up on my skills from my own kitchen, and began to \r\nfocus primarily on cake design. Now, more than 10 years \r\nlater, I’m still enjoying the challenge of making each and every cake \r\nunique and beautiful.\r\n\r\nSo, if you want to impress your guests at your next big party, think \r\nCAKE! I put the “sweet” in sweet-cream with my custom order cakes. I \r\ndesign each one specifically for each client. But, I believe a pretty \r\ncake isn’t worth much unless it tastes good too! That’s why all my \r\ncakes are made from scratch and guaranteed to be moist. With a wide \r\nvariety of flavors and filings, like white almond sour cream or triple \r\nchocolate delight, you’re sure to find something that will make you \r\ncome back for more. I do cakes for all occasions; especially weddings, \r\nbirthdays and parties!', `updated_at` = '2012-03-12 23:35:43' WHERE `abouts`.`id` = 2