app/controllers/messages_controller.rb

INSERT INTO `messages` (`name`, `message_type`, `delivery_time`, `delievery_type`, `design`, `message`, `created_at`, `email`, `special_instruction`, `updated_at`, `number`, `flavor`, `delivery_date`) VALUES ('1', 'order', '7', 'Delivery', '5', NULL, '2012-03-13 22:46:00', '2', 'kml;lsdkmlksdf 8', '2012-03-13 22:46:00', '3', '4', NULL)
---
  def create
    @message = Message.new(params[:message])

    respond_to do |format|
      if @message.save