app/controllers/projects_controller.rb

  def get_more
    @projects_already_displayed = Project.find(:all, :select => 'id', :order => "position, created_at DESC", :limit => params[:count])
---
SELECT `projects`.* FROM `projects` WHERE (id not in (21,20,19,18,17,15)) ORDER BY created_at DESC LIMIT 6

  def sort
    params[:project].each_with_index do |id, index|
      Project.update_all({:position => index+1}, {:id => id})
---
UPDATE `projects` SET `position` = 1 WHERE `projects`.`id` = 4

  def show
    @project = Project.find(params[:id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO `projects` (`description`, `created_at`, `photo_file_name`, `links`, `photo_content_type`, `photo_updated_at`, `updated_at`, `photo_file_size`, `title`) VALUES ('What bride wouldn\'t want this wonderful 3 tiered cake or one similar? Come on people! Come order one.', '2011-12-12 06:30:37', 'wedding.jpg', '', 'image/jpeg', '2011-12-12 06:30:37', '2011-12-12 06:30:37', 391312, 'Best Wedding Ever')

  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 3 LIMIT 1
UPDATE `projects` SET `updated_at` = '2011-12-31 07:02:58', `wedding` = 0, `special` = 0, `parties` = 1 WHERE `projects`.`id` = 1

  def destroy
    @project = Project.find(params[:id])
    @project.destroy
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 7 LIMIT 1
DELETE FROM `projects` WHERE `projects`.`id` = 7