app/controllers/users_controller.rb

INSERT INTO `users` (`email`, `password_hash`, `username`, `admin`, `updated_at`, `created_at`, `password_salt`) VALUES ('benhall2121@yahoo.com', '$2a$10$VGGp5FtM.QAZk8Anov5lWeIGzHX58JgnFs42Gx2sObbwNjdokAhKG', 'benhall2121', NULL, '2011-12-08 22:31:21', '2011-12-08 22:31:21', '$2a$10$VGGp5FtM.QAZk8Anov5lWe')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `password_salt` = '$2a$10$sSXPd90aw24ULenfucK1i.', `updated_at` = '2011-12-31 07:25:18', `password_hash` = '$2a$10$sSXPd90aw24ULenfucK1i.lF9MKJh3xJvkT1faIqre63ZiiWHoPMC' WHERE `users`.`id` = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])